rails-application-build-guide-sample/form/form_object_example/app/controllers/products_controller.rb

SELECT `products`.* FROM `products`  WHERE (`products`.`code` LIKE '%1000%')  ORDER BY `products`.`availability` DESC, `products`.`code` ASC
---
  def search
    @q = Product.search(search_params)
    @products = @q
      .result
      .order(availability: :desc, code: :asc)
      .decorate