rails-application-build-guide-sample/form/bulk_registration_form_example/app/controllers/outjson_controller.rb

  def show
  	@product = Product.find(2)
---
SELECT  `products`.* FROM `products`  WHERE `products`.`id` = 0 LIMIT 1